In [7]:
import pandas as pd 

import numpy as np 
from numpy.random import randn
np.random.seed(1256395)

In [15]:
df = pd.DataFrame(randn(5,4), index=['A', 'B', 'C', 'D', 'E'], columns=['Q1', 'Q2', 'Q3', 'Q4'])

In [16]:
df

         Q1        Q2        Q3        Q4
A  1.526741  0.511662 -0.094550 -1.250177
B  0.562966  0.547997  2.051938 -0.973809
C  1.467598 -1.855633 -0.399312 -0.667564
D -1.594550 -1.308865 -0.217414  0.607563
E -0.061156  0.361644 -0.117766 -0.127889

In [20]:
df.head(n=3)

         Q1        Q2        Q3        Q4
A  1.526741  0.511662 -0.094550 -1.250177
B  0.562966  0.547997  2.051938 -0.973809
C  1.467598 -1.855633 -0.399312 -0.667564

In [25]:
df <= 0.5

      Q1     Q2     Q3     Q4
A  False  False   True   True
B  False  False  False   True
C  False   True   True   True
D   True   True   True  False
E   True   True   True   True

In [28]:
df2 = df[df <= 0.5]

In [29]:
df2

         Q1        Q2        Q3        Q4
A       NaN       NaN -0.094550 -1.250177
B       NaN       NaN       NaN -0.973809
C       NaN -1.855633 -0.399312 -0.667564
D -1.594550 -1.308865 -0.217414       NaN
E -0.061156  0.361644 -0.117766 -0.127889

In [31]:
df2 = df[df ['Q2']<= 0.5]
df2

         Q1        Q2        Q3        Q4
C  1.467598 -1.855633 -0.399312 -0.667564
D -1.594550 -1.308865 -0.217414  0.607563
E -0.061156  0.361644 -0.117766 -0.127889

In [33]:
df2 = df[ (df['Q1'] <=0) & (df ['Q3']<= 0.5)]
df2

         Q1        Q2        Q3        Q4
D -1.594550 -1.308865 -0.217414  0.607563
E -0.061156  0.361644 -0.117766 -0.127889

In [38]:
df2 = df[ (df['Q1'] <=0) | (df ['Q3']<= 0.5)].loc['E']
df2

Q1   -0.061156
Q2    0.361644
Q3   -0.117766
Q4   -0.127889
Name: E, dtype: float64